#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.terraform_remote_state.github_actions: Reading...
aws_s3tables_table_bucket.main: Refreshing state... [name=tbills-scraper-s3-tables]
data.terraform_remote_state.github_actions: Read complete after 0s
aws_s3tables_namespace.main: Refreshing state...
aws_s3tables_table_bucket_policy.main: Refreshing state...
aws_s3tables_table.main: Refreshing state... [name=daily_yields]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.table_bucket_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "table_bucket_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3tables:CreateNamespace",
              + "s3tables:CreateTable",
              + "s3tables:CreateTableBucket",
              + "s3tables:DeleteNamespace",
              + "s3tables:DeleteTable",
              + "s3tables:DeleteTableBucket",
              + "s3tables:DeleteTableBucketEncryption",
              + "s3tables:DeleteTableBucketPolicy",
              + "s3tables:DeleteTablePolicy",
              + "s3tables:GetNamespace",
              + "s3tables:GetTable",
              + "s3tables:GetTableBucket",
              + "s3tables:GetTableBucketEncryption",
              + "s3tables:GetTableBucketMaintenanceConfiguration",
              + "s3tables:GetTableBucketPolicy",
              + "s3tables:GetTableData",
              + "s3tables:GetTableEncryption",
              + "s3tables:GetTableMaintenanceConfiguration",
              + "s3tables:GetTableMaintenanceJobStatus",
              + "s3tables:GetTableMetadataLocation",
              + "s3tables:GetTablePolicy",
              + "s3tables:ListNamespaces",
              + "s3tables:ListTableBuckets",
              + "s3tables:ListTables",
              + "s3tables:PutTableBucketEncryption",
              + "s3tables:PutTableBucketMaintenanceConfiguration",
              + "s3tables:PutTableBucketPolicy",
              + "s3tables:PutTableData",
              + "s3tables:PutTableEncryption",
              + "s3tables:PutTableMaintenanceConfiguration",
              + "s3tables:PutTablePolicy",
              + "s3tables:RenameTable",
              + "s3tables:UpdateTableMetadataLocation",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "GitHubActionsFullAccess"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::722696965592:role/tbills_scraper_github_actions_role",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_s3tables_namespace.main must be replaced
-/+ resource "aws_s3tables_namespace" "main" {
      ~ created_at       = "2025-08-10T02:11:56Z" -> (known after apply)
      ~ created_by       = "722696965592" -> (known after apply)
      ~ namespace        = "scraper" -> "treasury_bills" # forces replacement
      ~ owner_account_id = "722696965592" -> (known after apply)
      ~ table_bucket_arn = "arn:aws:s3tables:us-east-1:722696965592:bucket/tbills-scraper-s3-tables" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_s3tables_table.main must be replaced
-/+ resource "aws_s3tables_table" "main" {
      ~ arn                       = "arn:aws:s3tables:us-east-1:722696965592:bucket/tbills-scraper-s3-tables/table/d2b23ca8-e63e-493d-ad14-dc246829459b" -> (known after apply)
      ~ created_at                = "2025-08-10T20:30:55Z" -> (known after apply)
      ~ created_by                = "722696965592" -> (known after apply)
      ~ metadata_location         = "s3://d2b23ca8-e63e-493d-83q9iipu18m8c3prbtwtgahbexfrquse1b--table-s3/metadata/00028-d51dbc24-772e-410a-8584-b1ecedd68e2d.metadata.json" -> (known after apply)
      ~ modified_at               = "2025-08-25T00:12:33Z" -> (known after apply)
      + modified_by               = (known after apply)
        name                      = "daily_yields"
      ~ namespace                 = "scraper" -> "treasury_bills"
      ~ owner_account_id          = "722696965592" -> (known after apply)
      ~ table_bucket_arn          = "arn:aws:s3tables:us-east-1:722696965592:bucket/tbills-scraper-s3-tables" -> (known after apply) # forces replacement
      ~ type                      = "customer" -> (known after apply)
      ~ version_token             = "c64315a0489319aaec65" -> (known after apply)
      ~ warehouse_location        = "s3://d2b23ca8-e63e-493d-83q9iipu18m8c3prbtwtgahbexfrquse1b--table-s3" -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3tables_table_bucket.main must be replaced
-/+ resource "aws_s3tables_table_bucket" "main" {
      ~ arn                       = "arn:aws:s3tables:us-east-1:722696965592:bucket/tbills-scraper-s3-tables" -> (known after apply)
      ~ created_at                = "2025-08-10T02:11:55Z" -> (known after apply)
      ~ name                      = "tbills-scraper-s3-tables" -> "financial-data" # forces replacement
      ~ owner_account_id          = "722696965592" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3tables_table_bucket_policy.main must be replaced
-/+ resource "aws_s3tables_table_bucket_policy" "main" {
      ~ resource_policy  = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3tables:UpdateTableMetadataLocation",
                          - "s3tables:RenameTable",
                          - "s3tables:PutTablePolicy",
                          - "s3tables:PutTableMaintenanceConfiguration",
                          - "s3tables:PutTableEncryption",
                          - "s3tables:PutTableData",
                          - "s3tables:PutTableBucketPolicy",
                          - "s3tables:PutTableBucketMaintenanceConfiguration",
                          - "s3tables:PutTableBucketEncryption",
                          - "s3tables:ListTables",
                          - "s3tables:ListTableBuckets",
                          - "s3tables:ListNamespaces",
                          - "s3tables:GetTablePolicy",
                          - "s3tables:GetTableMetadataLocation",
                          - "s3tables:GetTableMaintenanceJobStatus",
                          - "s3tables:GetTableMaintenanceConfiguration",
                          - "s3tables:GetTableEncryption",
                          - "s3tables:GetTableData",
                          - "s3tables:GetTableBucketPolicy",
                          - "s3tables:GetTableBucketMaintenanceConfiguration",
                          - "s3tables:GetTableBucketEncryption",
                          - "s3tables:GetTableBucket",
                          - "s3tables:GetTable",
                          - "s3tables:GetNamespace",
                          - "s3tables:DeleteTablePolicy",
                          - "s3tables:DeleteTableBucketPolicy",
                          - "s3tables:DeleteTableBucketEncryption",
                          - "s3tables:DeleteTableBucket",
                          - "s3tables:DeleteTable",
                          - "s3tables:DeleteNamespace",
                          - "s3tables:CreateTableBucket",
                          - "s3tables:CreateTable",
                          - "s3tables:CreateNamespace",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::722696965592:role/tbills_scraper_github_actions_role"
                        }
                      - Resource  = [
                          - "arn:aws:s3tables:us-east-1:722696965592:bucket/tbills-scraper-s3-tables/namespace/scraper/table/daily_yields",
                          - "arn:aws:s3tables:us-east-1:722696965592:bucket/tbills-scraper-s3-tables/namespace/scraper",
                          - "arn:aws:s3tables:us-east-1:722696965592:bucket/tbills-scraper-s3-tables",
                        ]
                      - Sid       = "GitHubActionsFullAccess"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ table_bucket_arn = "arn:aws:s3tables:us-east-1:722696965592:bucket/tbills-scraper-s3-tables" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan"

```

</details>

*Pusher: @yangwu1227, Action: `pull_request`, Workflow: `S3 Table Bucket Terraform Workflow`*